// let sum = 0;
// while (true) {
//   let value = +prompt("Введіть число", "");
//   if (!value) break; // (*)
//   sum += value;
// }
// alert("Сума: " + sum);

// Цей фрагмент коду JavaScript застосовує функцію prompt() для отримання введення від користувача.
// Після виконання користувачем введення числа, воно приводиться до числового типу даних за допомогою оператора + перед prompt().
// Однак, замість того, щоб просто вказувати let value = +prompt("Введіть число", "");, бажано перевіряти, чи значення, введене користувачем, є числом.
// Один з варіантів перевірки може бути застосуванням функції isNaN(), яка повертає true, якщо їй передане значення не є числом. Отже, код буде виглядати так:

// let value = prompt("Введіть число", "");
// if (!isNaN(value)) {
//   value = Number(value);
//   console.log("Введене число:", value);
// } else {
//   console.log("Ви ввели не число");
// }

// Таким чином, якщо користувач введе число, воно збережеться в змінній value як числове значення,
// і відбудеться виведення відповідного повідомлення.В іншому випадку, якщо введено нечислове значення, виведеться інше повідомлення.

// ~При завантаженні сторінки користувачеві пропонується
// в prompt ввести число. Введення додається до значення
// змінної total.
// Операція введення числа триває до того часу,
// поки користувач не натисне кнопку Cancel в prompt.
// Після того, як користувач припинив введення натиснувши на
// кнопку Cancel, показати alert з рядком "Загальна сума введених чисел дорівнює [число]."
// Робити перевірку,що користувач ввів саме число,
// ~а не довільний набір символів, не потрібно.

let enterNumber = prompt("Введіть число", "");
let sum = 0;
let check = true;
do {
  if (enterNumber) {
    if (!isNaN(enterNumber)) {
      sum += Number(enterNumber);
      enterNumber = prompt("Введіть число");
    } else {
      enterNumber = prompt("Ви ввели не число. Введіть число");
    }
  } else {
    check = false;
    console.log(`"Загальна сума введених чисел дорівнює ${sum}."`);
  }
} while (check);

// ПРАЦЮЄ НЕКОРЕКТНО_________________
// let enterNumber = +prompt("Введіть число", "");
// let sum = 0;
// let check = true;
// do {
//   if (enterNumber) {
//     if (!isNaN(enterNumber)) {
//       sum += enterNumber;
//       enterNumber = +prompt("Введіть число");
//     } else {
//       enterNumber = +prompt("Ви ввели не число. Введіть число");
//     }
//   } else {
//     check = false;
//     console.log(`Загальна сума введених чисел дорівнює ${sum}.`);
//   }
// } while (check);
