// DOM надає широкий спектр можливостей для роботи з елементом і його вмістом.Але щоб
// скористатися цими можливостями, спочатку потрібно отримати посилання на нього, наприклад,
// за допомогою методу

document.querySelector();

// Елементи DOM - дерева мають ієрархічне відношення один до одного.Для опису відносин
// використовуються терміни предок(ancestor), нащадок(descendant), батько(parent),
// дитина(child) і сусід(sibling).

// Найвищий елемент називається кореневим (root node).
// Кожен елемент, крім кореневого, має тільки один батьківський.
// В елемента може бути скільки завгодно дітей.
// Сусіди — це елементи зі спільним батьківським елементом.
// Дочірні елементи(діти) — елементи, що безпосередньо вкладені в поточний елемент
//     (елементи першого рівня вкладеності).
// Нащадки — усі елементи, які знаходяться в поточному елементі, разом з їхніми дітьми,
//     дітьми їхніх дітей тощо.Тобто все на зразок дерева.

// На схемі нижче < ul > — це батьківський елемент.Три елементи < li > — діти для < ul > і
// сусіди між собою.Так само елементи < span >, <a>, <p> є сусідами. Усі вони — діти для
//     <li> і нащадки для <ul>.

// Для навігації по цій ієрархії елементи мають такі властивості:
<img src="../../img/схема.png"></img>;
// elem.parentNode — містить посилання на батьківський вузол-елемент вузла elem
// elem.childNodes — містить псевдомасив, у якому зібрані всі дочірні вузли-елементи і т
// екстові вузли вузла elem
// elem.children — містить псевдомасив, у якому зібрані всі дочірні вузли-елементи вузла
// elem, тобто ті, що відповідають тегам
// elem.firstChild — містить посилання на перший дочірній вузол (вузол-елемент або
// текстовий вузол) вузла elem
// elem.firstElementChild — містить посилання на перший дочірній вузол-елемент усередині
// elem, тобто той, що відповідає тегу
// elem.lastChild — містить посилання на останній дочірній вузол (вузол-елемент або
// текстовий вузол) вузла elem
// elem.lastElementChild — містить посилання на останній дочірній вузол-елемент усередині
// elem, тобто той, що відповідає тегу
// elem.previousSibling — містить посилання на попередній сусідній вузол відносно
// елемента elem, і це може бути як елемент, так і текстовий вузол
// elem.previousElementSibling — містить посилання на попередній сусідній вузол-елемент
// відносно елемента elem, тобто той, що відповідає тегу
// elem.nextSibling — містить посилання на наступний сусідній вузол відносно елемента
// elem, і це може бути як елемент, так і текстовий вузол
// elem.nextElementSibling — містить посилання на наступний сусідній вузол-елемент
// відносно елемента elem, тобто той, що відповідає тегу

// Усі ці властивості, по суті, є структурою DOM - дерева.Їх варто знати для розуміння DOM.
// Також питання про ці властивості можуть бути на співбесіді.На практиці, однак, вони
// застосовуються дуже рідко, оскільки вкладеність елементів і їх кількість може динамічно
// змінюватись.Це робить код з використанням цих властивостей ненадійним.
