// Пошук елементів.
// Тобі вже відомо, що DOM - елемент — це об'єкт із властивостями й методами. Саме час
// навчитися швидко знаходити елемент за довільним CSS - селектором.

// Група методів elem.querySelector * — це сучасний стандарт для пошуку елементів.Вони
// дозволяють знайти елемент або групу елементів за CSS - селектором.

element.querySelector(selector);

// Використовується, якщо необхідно знайти тільки один, найчастіше унікальний елемент.

// Повертає перший знайдений елемент усередині element, що відповідає рядку CSS - селектора
// selector.Навіть якщо їх декілька, завжди повернеться посилання тільки на перший елемент
// у DOM - дереві.
// Якщо нічого не знайдено, то поверне null
// ul.list->li.list-item
//      |-->li.list-item
const item = document.querySelector(".list-item");

// Доступ до DOM починається з об'єкта document, з нього можна дістатися до будь-яких
// елементів.Об’єкт document — це частина глобального об'єкта window, який доступний у
// скрипті, коли він виконується в браузері.Так само як alert, console.log і багато інших.

element.querySelectorAll(selector);

// Використовується, якщо необхідно знайти колекцію елементів, тобто отримати масив посилань
// на елементи з однаковим селектором.Наприклад, усі елементи списку з класом list - item.

// Повертає псевдомасив усіх елементів всередині element, які відповідають CSS - селектору
// selector
// Якщо нічого не знайдено, поверне порожній масив

const listItem = document.querySelectorAll(".list-item");
