// Об'єкт події
// Для обробки події недостатньо знати, що подія — це клік або натискання клавіші.
// Розробнику можуть знадобитися інші деталі, а саме: елемент, на якому відбулася
// подія, його поточне значення текстового поля, вбудовані методи тощо.
// Кожна подія — це об'єкт, який містить інформацію про деталі події та автоматично
// передається першим аргументом в обробник події.Усі події відбуваються з базового
// класу Event.

// const handleClick = event => {
//   console.log(event);
// };

// button.addEventListener("click", handleClick);

// Параметр event — це і є об'єкт події, який автоматично передається першим аргументом
// під час виклику колбек - функції.Ми можемо називати його як завгодно, але, як правило,
// його оголошують як e, evt або event.

// Деякі властивості об'єкта події:

// event.type — тип події.
// event.currentTarget — елемент, на якому виконується обробник події.
