// Події клавіатури
// Існує дві основні події клавіатури:

// keydown — подія, що відбувається при натисканні клавіші
// keyup — подія, що відбувається, коли клавішу відпустили

// На відміну від інших подій, події клавіатури обробляються на документі, а не
// на конкретному елементі.Об'єкти подій клавіатури походять від базового класу
// KeyboardEvent.

// document.addEventListener("keydown", (event) => {
//   console.log("Keydown: ", event);
// });

// document.addEventListener("keyup", (event) => {
//   console.log("Keyup: ", event);
// });

// Події keydown і keyup спрацьовують при натисканні будь - якої клавіші, включно зі
// службовими(Ctrl, ShiftAltEscape тощо).
// На практиці переважно обробляють тільки подію keydown, оскільки вона відбувається
// швидше за keyup і користувач раніше бачить результат натискання.

// //
// Властивості key і code
// Властивість об’єкта події key повертає символ, згенерований натисканням клавіші на
// клавіатурі.Ця властивість враховує:
// стан клавіш-модифікаторів, наприклад Shift
// поточну мову
// Властивість об’єкта події code повертає код фізичної клавіші на клавіатурі й не залежить
// від мови та стану клавіш-модифікаторів.

document.addEventListener("keydown", (event) => {
  console.log("key: ", event.key);
  console.log("code: ", event.code);
});

//
//
// Клавіші - модифікатори;
// Для обробки комбінацій клавіш на об'єкті події є властивості:

ctrlKey;
altKey;
shiftkey;
metaKey;

// Ці властивості зберігають булеве значення, яке вказує, чи була затиснута відповідна
// клавіша - модифікатор.

document.addEventListener("keydown", (event) => {
  if ((event.ctrlKey || event.metaKey) && event.code === "KeyS") {
    console.log("«Ctrl + s» or «Command + s» combo");
  }
});

// Нещодавно для обробки комбінації клавіш використовували властивість keyCode.Більшість
// постів на форумах і блогах все ще можуть використовувати її.Пам’ятай: keyCode вже
// застаріла, і замість неї варто використовувати властивості key і code.
