// Подія submit
// Відправлення форми відбувається:
// при кліку на кнопку з атрибутом type="submit"
// Або
// при натисканні клавіші Enter під час перебування в будь-якому її текстовому полі форми
// Подія submit відбувається безпосередньо на формі (тег form), тому обробник подій слід
// встановлювати саме на ній.

const form = document.querySelector("form");

form.addEventListener("submit", (event) => {
  // ...
});

// Деякі події викликають дію браузера, вбудовану за замовчуванням як реакція на певний тип
// події.Наприклад, клік на посиланні ініціює перехід на нову адресу, зазначену в href, а
// відправлення форми перезавантажує сторінку.

//
// //
// Подія change
// Подія change відбувається після зміни елемента форми.
// Для текстових полів або textarea подія відбудеться не на кожному введенні символу, а
// після втрати фокусу.Це не завжди зручно.Уяви, що користувач набирає щось у текстовому
// полі — подія відсутня.Щойно фокус пропав, відбудеться подія change.
// Для інших елементів, наприклад, select, чекбоксів і радіокнопок, подія change спрацьовує
// відразу під час вибору значення.

//
// //
// Подія input
// Подія input відбувається тільки на текстових полях і textarea.
// Вона створюється щоразу при зміні значення елемента, не чекаючи втрати фокусу.На
// практиці input — це найголовніша подія для роботи з текстовими полями форми.
// Порівняємо події input і change на текстових полях і textarea
// Подія input:
// відбувається при кожній зміні значення (при введенні або видаленні)
// не залежить від втрати фокусу

// Подія change:
// відбувається після втрати фокусу за умови, що відбулася зміна значення в елементі
