// Подія focus і blur
// Елемент отримує фокус під час кліку миші або переходу клавішею Tab.
// Момент отримання і втрати фокусу дуже важливий.Отримуючи фокус, ми можемо завантажити
// дані для автозаповнення, почати відстежувати зміни тощо.
// Під час втрати фокусу — перевірити введені дані.
// подія focus відбувається під час фокусування на елементі
// подія blur відбувається при втраті фокусу, наприклад, користувач клікає в іншому місці
// екрана
// Активувати або скасувати фокус можна програмно.Для цього треба викликати в коді для
// елемента однойменні методи focus() і blur().
