// Алгоритм визначення this
// Ключове слово this — це одна з найзаплутаніших концепцій для новачка.
// Новачки часто підставляють this методом наукового тику доти, доки скрипт не спрацює.

// Але все стає значно простішим, коли є простий алгоритм визначення значення this.

// Крок 1
// Це стрілочна функція?
// Якщо відповідь Так, значення this те саме, що у this у зовнішній області видимості
// Якщо відповідь Ні, переходь на Крок 2

// Крок 2
// Чи використовуються методи call, apply або bind?
// Якщо відповідь Так, значення this — це той самий об’єкт, що передали при їх виклику
// Якщо відповідь Ні, переходь на Крок 3

// Крок 3
// Функція викликається як метод об’єкта object.method?
// Якщо відповідь Так, значення this — це об’єкт ліворуч від крапки
// Якщо відповідь Ні, переходь на Крок 4

// Крок 4
// Скрипт виконується в суворому режимі?
// Якщо відповідь Так, значення this — undefined
// Якщо відповідь Ні, значення this — window

// Збережи собі цю схему, щоб швидко згадати алгоритм визначення this
